Revit 2027 API
PolyLine.Evaluate Method
Evaluates a parameter on the polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Evaluate(
	double param
)
Public Function Evaluate (
	param As Double
) As XYZ
public:
XYZ^ Evaluate(
	double param
)
member Evaluate :
        param : float -> XYZ
Parameters
param Double
The parameter to be evaluated. It is expected to be in [0,1] interval mapped to the bounds of the whole polyline.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the param value is not between 0.0 and 1.0.
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace